spec/fixtures/vcr_cassettes/Billing_address_update/user_is_not_billable/with_an_incomplete_billing_address_and_no_credit_card/Updates_his_billing_address_and_credit_card_successfully_with_a_return_to_path.yml

---
http_interactions:
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/orderdirect.asp
    body:
      encoding: UTF-8
      string: ALIAS=Y7QHFXJ6&CARDNO=4111111111111111&CN=Jilion+Team&CVC=111&ECI=7&ED=0614&EMAIL=email3%40user.com&FLAG3D=Y&HTTP_ACCEPT=%2A%2F%2A&Operation=RES&OwnerZip=42666&Owneraddress=42+Abey+Road&PARAMPLUS=CHECK_CC_USER_ID%3D595&PSPID=jilion&PSWD=WWQMNC89&SHASign=B27023D705A2D14DE90340F1829A6BD6A033A46845EC0FD03DFACC8578BF283CD20A1A6AFF595B5D5B2EAAC174097D0F22E47F4F861AC6D64A3E7E30824CB410&USERID=sublime&WIN3DS=MAINW&amount=1&currency=USD&orderID=9f246f922fb44009705904080ffb7e&ownercty=us&ownertown=New+York
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 02 Oct 2013 07:53:30 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '339'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Wed, 02 Oct 2013 07:52:28 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_485090132_0=1887424620_2213321;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?><ncresponse\r\norderID=\"9f246f922fb44009705904080ffb7e\"\r\nPAYID=\"24048559\"\r\nNCSTATUS=\"0\"\r\nNCERROR=\"0\"\r\nACCEPTANCE=\"test123\"\r\nSTATUS=\"5\"\r\nIPCTY=\"99\"\r\nCCCTY=\"US\"\r\nECI=\"12\"\r\nCVCCheck=\"NO\"\r\nAAVCheck=\"NO\"\r\nVC=\"NO\"\r\namount=\"0.01\"\r\ncurrency=\"USD\"\r\nPM=\"CreditCard\"\r\nBRAND=\"VISA\"\r\nALIAS=\"Y7QHFXJ6\"\r\nNCERRORPLUS=\"!\">\r\n</ncresponse>"
    http_version: 
  recorded_at: Wed, 02 Oct 2013 07:53:30 GMT
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/maintenancedirect.asp
    body:
      encoding: UTF-8
      string: Operation=DES&PAYID=24048559&PSPID=jilion&PSWD=WWQMNC89&SHASign=F0C8A0747F32CDCB733F7066A1F39CA03CE7D3C584E1C638FF3D632DCB4894422F80A4AE211A3A25967AB64928EA5D22469BE7A2C157C569E4611E919B29B936&USERID=sublime
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 02 Oct 2013 07:53:31 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '229'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Wed, 02 Oct 2013 07:52:30 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_485090132_0=1887424672_2213321;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?>\r\n<ncresponse\r\norderID=\"9f246f922fb44009705904080ffb7e\"\r\nPAYID=\"24048559\"\r\nPAYIDSUB=\"1\"\r\nNCSTATUS=\"0\"\r\nNCERROR=\"0\"\r\nNCERRORPLUS=\"!\"\r\nACCEPTANCE=\"\"\r\nSTATUS=\"61\"\r\namount=\"0.01\"\r\ncurrency=\"USD\">\r\n</ncresponse>\r\n"
    http_version: 
  recorded_at: Wed, 02 Oct 2013 07:53:31 GMT
- request:
    method: post
    uri: https://secure.ogone.com/ncol/test/maintenancedirect.asp
    body:
      encoding: UTF-8
      string: Operation=DES&PAYID=24048559&PSPID=jilion&PSWD=WWQMNC89&SHASign=F0C8A0747F32CDCB733F7066A1F39CA03CE7D3C584E1C638FF3D632DCB4894422F80A4AE211A3A25967AB64928EA5D22469BE7A2C157C569E4611E919B29B936&USERID=sublime
    headers:
      Content-Type:
      - application/x-www-form-urlencoded
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - '*/*'
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Wed, 02 Oct 2013 07:53:31 GMT
      Server:
      - Microsoft-IIS/6.0
      X-Powered-By:
      - ASP.NET
      Connection:
      - close
      Content-Length:
      - '257'
      Content-Type:
      - text/XML; Charset=iso-8859-1
      Expires:
      - Wed, 02 Oct 2013 07:52:31 GMT
      Cache-Control:
      - private, max-age=0
      Set-Cookie:
      - avr_581370806_0_0_4294901760_485090132_0=1888900531_2213322;max-age=600;path=/
    body:
      encoding: UTF-8
      string: "<?xml version=\"1.0\"?>\r\n<ncresponse\r\norderID=\"9f246f922fb44009705904080ffb7e\"\r\nPAYID=\"24048559\"\r\nPAYIDSUB=\"2\"\r\nNCSTATUS=\"5\"\r\nNCERROR=\"50001127\"\r\nNCERRORPLUS=\"|this
        order is not authorized|\"\r\nACCEPTANCE=\"\"\r\nSTATUS=\"0\"\r\namount=\"\"\r\ncurrency=\"\">\r\n</ncresponse>\r\n"
    http_version: 
  recorded_at: Wed, 02 Oct 2013 07:53:31 GMT
recorded_with: VCR 2.6.0
